nums=[1,2,3,4]
print("Списък от числа: ", nums)
print("Дтължина на списъка", len(nums))
print("Първи елемент: ", nums[0])
print("Second element: ", nums[1])
print("Last element: ", nums[-1])
print("highest value: ", max(nums))
print("lowest value: ", min(nums))
print("Sum: ", sum(nums))
print("Reversed list: ", list(reversed(nums)))
print("Growing value: ", sorted(nums))
print("Lowering value", sorted(nums, reverse=True))
#МНОГО ВАЖНО СЛЕД РЕД 13! "СРЕЗ"
print("Изходен списък: ", nums)
#Промяна на стойността на елемент от списъка:
nums[1]="текст"
#След това показваме съдържанието от списъка на вече променената стойност:
print("След осъществяване на програмата: ", nums)
#Срез
print("Срез: ", nums[1:len(nums)-1])
#На ред 20 ако -1 беше в кавички, то щеше да се покаже аргументът с най-малка стойност в листа, т.е. 1.
#Но написан така, кодът се чете: принтиране на аргумента в конзолата като срез("текст"), дължина на списъка(len(nums) и -1 означава без последния аргумент, т.е. 4
print("Срез2: ", nums[1: nums[2]])
#Замяна на част от елементите от списъка:
nums[1:len(nums)-1]=["A", "B"]
print("След замяната на елемените: ", nums)
#списък с числата от 2 до 4
nums=list(range(2, 4+1))
#+1 В случая се добавя, за да може конзолата да разбере, че аргументът не е само числата 2 и 3, а +1 означава 4 включитлено.
print("Списък с числата от 2 до 4: ", nums )
#изтриване на елементи от списъка
nums[0:1]=[]
print("Изтриване на елементи от списъка: ", nums)
nums=[1,2,3,4]
del nums[len(nums)-1]
print("last digit deleted: ", nums)
#Изтриване на последния елемент
nums=[1,2,3,4,5,6]
del nums[len(nums)-1]
print("Изтриване на последния елемент: ", nums)
#нечетни числа:
nums=[2*k+1 for k in range (10)]
#10 в горния пример е броят на нечетните числа като аргументи които да се принтират в конзолата
print("Нечетни числа: ", nums)
#Създаване на списък от символи въз основа на текст:
symbs=list("Python")
print("Списък от символи (текстови символи symbs):", symbs)
#Първите два символа:
symbs=symbs[:2]
print("Принтиране на първите два символа:", symbs)
#Гореизложеният пример е вариант номер 1. Вариант номер 2 е print("принтиране на първите два символа: ", symbs[:2])
#symbs=symbs[0:1+1] print("Принтиране на първите два символа:", symbs)
#Останалите символи:
symbs=list("Python")
symbs=symbs[2-1:]
print("останалите символи: ", symbs[1:])
