#Вариант номер 2 за Пайтхон
#Прочитане на броя на слагаемите:
n=input("Посочете броя на слагаемите: ")
#Въвеждаме променлива с текстова стойност:
txt="1"
#Въвеждаме индексна променлива:
k=1
#Въвежда се операторът за цикли за формиране на текста с израза # за сумата на естествените числа:
while str(k)!=n:
    #Увеличаване стойността на индексната променлива:
    k=k+1
    #Добавяне на фрагмент към текста с израза # за сумата на естествените числа:
    txt=txt+"+"+str(k)
    #Показване на резултата:
    print(txt, "=", eval(txt))

    x = int(input("Въведете горна граница на числата: "))
    k = 0  # к е началната стойност на сумата
    s = 0  # s е индексната променлива
    while s < x:
        s = s + 1
        k = k + s
        print("Сумата на числата от 1 до", x, "е", k)