#Първи клас:
class Alpha:
    "Това е клас алфа" #Този текстов литерал (ред) се нарича документиращ низ на класа
    pass
#Втори клас:
class Bravo:
    "Това е клас Bravo"
    pass
#Информация за класовете:
print(Alpha.__doc__)
print(Bravo.__doc__)
#Обекти на класовете:
A = Alpha()
B = Bravo()

#Изменение на документиращия низ:
Alpha.__doc__  = "Първи клас"
B.__class__.__doc__ = "Втори клас"

#Информация за класовете:
print(A.__class__.__doc__)
print(B.__doc__)

#До документиращия низ достигаме чрез 1. името на класа.__doc__ или 2.обектите на класа._class__.__doc__/ във втория случай чрез __class__ ние получаваме референция към класа на обекта./)
print(A.__doc__)
print(B.__doc__)
#A.__class__.__doc__ != A.__doc__, защото обектът няма атрибут, съответно търсенето продължава в класа (във втория случай).

