#прочитане на горната граница на сумата:
n=int(input("Посочете горната граница на сумата: "))
#начална стойност на сумата:
s=0
#начална стойност на индексната променлива:
k=0
#оператор за цикъл за изчисление на сумата:
while k<n:
    #Увеличаване стойността на индексната променлива с # единица:
    k=k+1
#Прибавяне на слагаемо към сумата:
    s=s+k
#показване на резултата:
print("Сумата на числата от 1 до", n, "е равна на", s)


n=int(input("Insert the wanted value: "))
s=0
k=0
while k<n:
    k=k+1
    s=s+k
print("sum of numbers from 1 to ", n, "is equal to ", s)
#Като променива n потребителят пише горната граница на желаното число. int е променливата, която изисква числена стойност (str изисква текстова)
#s и k са съответно началната стойност за сумата и индексната променлива за сумата. След това индексната променлива се увеличава с единица +1 и от тук се прибавя отново към началната сума.

x=int(input("Посочете горната граница на сумата: "))
s=0
k=0
while k<x:
    s=0
    k=k+1
    s=s+k
print("сумата между числата от 1 до", x, "ще бъде равна на:", s)


x=int(input("Въведете горна стойност: "))
s=0
k=0
while k<x:
    k=k+1
    s=s+k
    print("Въведената сума на стойността от 1 до ", x, "изразена като възходяща регресия,е ", s)
print("Сумата на въведената стойност от 1 до", x, "изразена като сбор, е ", s)